Core/src/InformationRegisters/СинонимиВалют/СинонимиВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СинонимиВалют</name>
  <resources>
    <name>РусПолеПрописиЦел1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РусПолеПрописиЦел2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РусПолеПрописиЦел3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РусПолеПрописиДроб1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РусПолеПрописиДроб2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РусПолеПрописиДроб3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрузПолеПрописиЦел1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрузПолеПрописиДроб1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АнглПолеПрописиЦел1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АнглПолеПрописиЦел2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АнглПолеПрописиДроб1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АнглПолеПрописиДроб2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлинаДробнойЧасти</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/СинонимиВалют/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ПараметрыПрописиНаРусском = ТекущийОбъект.РусПолеПрописиЦел1 +", "
	+ ТекущийОбъект.РусПолеПрописиЦел2 +", " 
	+ ТекущийОбъект.РусПолеПрописиЦел3 +", "
	+" ,"
	+ ТекущийОбъект.РусПолеПрописиДроб1 +", "
	+ ТекущийОбъект.РусПолеПрописиДроб2 +", "
	+ ТекущийОбъект.РусПолеПрописиДроб3 +", "
	+" ,";
	//+ ТекущийОбъект.ДлинаДробнойЧасти;
	
	ПараметрыПрописиНаГрузинском = ТекущийОбъект.ГрузПолеПрописиЦел1 +", "
	+ ТекущийОбъект.ГрузПолеПрописиДроб1 +", ";
	
	//+ ТекущийОбъект.ДлинаДробнойЧасти;
	
	ПараметрыПрописиНаАнглиском = ТекущийОбъект.АнглПолеПрописиЦел1 +", "
	+ ТекущийОбъект.АнглПолеПрописиЦел2 +", " 
	+ ТекущийОбъект.АнглПолеПрописиДроб1 +", "
	+ ТекущийОбъект.АнглПолеПрописиДроб2 +", ";
	
	ОбВалюта = ТекущийОбъект.Валюта.ПолучитьОбъект(); 	
	ОбВалюта.ПараметрыПрописиНаРусском = ПараметрыПрописиНаРусском;
	ОбВалюта.ПараметрыПрописиНаГрузинском = ПараметрыПрописиНаГрузинском;
	ОбВалюта.ПараметрыПрописиНаАнглиском = ПараметрыПрописиНаАнглиском;
	ОбВалюта.Записать();
	
	
КонецПроцедуры
